apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    if ((phy_state != BLE_PHY_STATE_TX && phy_state != BLE_PHY_STATE_RX) ||
        transition == PHY_TRANS_NONE) {
        ble_phy_disable();

        return 1;
    }

    anchor_time = ble_phy_transition_anchor_get(tifs_anchor, phy_state, cur_phy_mode);
    start_time = anchor_time + tifs_usecs;
    radio_time = start_time;

    ble_phy_transition_fem(transition, start_time);

    if (transition == PHY_TRANS_TO_TX) {
        /* Adjust for TX rump-up */
        radio_time -= BLE_PHY_T_TXENFAST;
        /* Adjust for delay between EVENT_READY and actual TX start time */
        radio_time -= g_ble_phy_t_txdelay[next_phy_mode];
        phy_ppi_timer0_compare0_to_radio_txen_enable();
    } else { /* transition == PHY_TRANS_TO_RX */
        /* Adjust for RX rump-up */
        radio_time -= BLE_PHY_T_RXENFAST;
        /* Start listening a bit earlier due to allowed active clock accuracy */
        radio_time -= 2;
        phy_ppi_timer0_compare0_to_radio_rxen_enable();
    }

    if (transition == PHY_TRANS_TO_TX) {
        /* Need to check if TIMER0 did not already count past CC[0] and/or CC[2], so
         * we're not stuck waiting for events in case radio and/or PA was not
         * started. If event was triggered we're fine regardless of timer value.
         *
         * Note: CC[3] is used only for wfr which we do not need here.
         */
        nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE3);
        is_late = (NRF_TIMER0->CC[3] > radio_time) && !NRF_TIMER0->EVENTS_COMPARE[0];
#if PHY_USE_FEM_PA
        is_late = is_late || ((NRF_TIMER0->CC[3] > NRF_TIMER0->CC[2]) &&
                              !NRF_TIMER0->EVENTS_COMPARE[2]);
#endif
        if (is_late) {
            ble_phy_disable();
            phy_ppi_fem_disable();
            phy_ppi_timer0_compare0_to_radio_txen_disable();
            g_ble_phy_data.phy_transition_late = 1;

            return 1;
        }
    } else if (transition == PHY_TRANS_TO_RX) {
        /* Setup wfr relative to expected radio/PDU start */
        wfr_time = start_time;
        /* Add amount of usecs to wait */
        wfr_time += wfr_usecs;
        /* Adjust for receiving access address since this triggers EVENT_ADDRESS */
        wfr_time += ble_phy_mode_pdu_start_off(next_phy_mode);
        /* Adjust for delay between actual access address RX and EVENT_ADDRESS */
        wfr_time += g_ble_phy_t_rxaddrdelay[next_phy_mode];
        /* Wait a bit longer due to allowed active clock accuracy */
        wfr_time += 2;
        /*
         * It's possible that we'll capture PDU start time at the end of timer
         * cycle and since wfr expires at the beginning of calculated timer
         * cycle it can be almost 1 usec too early. Let's compensate for this
         * by waiting 1 usec more.
         */
        wfr_time += 1;
        wfr_time += MYNEWT_VAL(BLE_PHY_EXTENDED_TIFS);
        ble_phy_wfr_enable_at(wfr_time);

        /* In case TIMER0 did already count past CC[0] and/or CC[2], radio
         * and/or LNA may not be enabled. In any case we won't be stuck since
         * wfr will cancel rx if needed.
         *
         * FIXME failing to enable LNA may result in unexpected RSSI drop in
         *       case we still rxd something, so perhaps we could check it here
         */
    }

    nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;

    return 0;
}

/**
 * Called from interrupt context when the transmit ends
 *
 */
static void
ble_phy_tx_end_isr(void)
{
    uint8_t cur_phy_mode;
    uint8_t next_phy_mode;
    uint8_t was_encrypted;
    uint8_t transition;
    uint16_t wfr_usecs;
    uint16_t tifs_usecs;
    uint8_t tifs_anchor;

    /* If this transmission was encrypted we need to remember it */
    was_encrypted = g_ble_phy_data.phy_encrypted;
    (void)was_encrypted;

    /* Better be in TX state! */
    assert(g_ble_phy_data.phy_state == BLE_PHY_STATE_TX);

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    /*
     * XXX: not sure what to do. We had a HW error during transmission.
     * For now I just count a stat but continue on like all is good.
     */
    if (was_encrypted) {
        if (NRF_CCM->EVENTS_ERROR) {
            STATS_INC(ble_phy_stats, tx_hw_err);
            NRF_CCM->EVENTS_ERROR = 0;
        }
    }
#endif

    if (g_ble_phy_data.txend_cb) {
        g_ble_phy_data.txend_cb(g_ble_phy_data.txend_arg);
    }

    transition = g_ble_phy_data.phy_transition;
    if (transition == PHY_TRANS_NONE) {
        g_ble_phy_data.phy_transition = PHY_TRANS_NONE;
        g_ble_phy_data.tifs_usecs = BLE_LL_IFS;
        g_ble_phy_data.wfr_usecs = 0;

        /*
         * XXX: not sure we need to stop the timer here all the time. Or that
         * it should be stopped here.
         */
        nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_STOP);
        NRF_TIMER0->TASKS_SHUTDOWN = 1;
        phy_ppi_wfr_disable();
        phy_ppi_timer0_compare0_to_radio_txen_disable();
        phy_ppi_rtc0_compare0_to_timer0_start_disable();

        return;
    }

    wfr_usecs = g_ble_phy_data.wfr_usecs;
    tifs_usecs = g_ble_phy_data.tifs_usecs;
    tifs_anchor = g_ble_phy_data.tifs_anchor;
    cur_phy_mode = g_ble_phy_data.phy_cur_phy_mode;
    next_phy_mode = cur_phy_mode;

    if (transition == PHY_TRANS_TO_RX) {
#if MYNEWT_VAL(BLE_LL_PHY)
        ble_phy_mode_apply(g_ble_phy_data.phy_rx_phy_mode);
#endif
        /* Packet pointer needs to be reset. */
        ble_phy_rx_xcvr_setup();
        next_phy_mode = g_ble_phy_data.phy_rx_phy_mode;
    }

    ble_phy_transition(transition, tifs_anchor, tifs_usecs, wfr_usecs,
                       BLE_PHY_STATE_TX, cur_phy_mode, next_phy_mode);

    /* Return to default values for the next transition */
    g_ble_phy_data.phy_transition = PHY_TRANS_NONE;
    g_ble_phy_data.tifs_anchor = PHY_TRANS_ANCHOR_END;
}

static inline uint8_t
ble_phy_get_cur_rx_phy_mode(void)
{
    uint8_t phy;

    phy = g_ble_phy_data.phy_cur_phy_mode;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    /*
     * For Coded PHY mode can be set to either codings since actual coding is
     * set in packet header. However, here we need actual coding of received
     * packet as this determines pipeline delays so need to figure this out
     * using CI field.
     */
    if ((phy == BLE_PHY_MODE_CODED_125KBPS) ||
                                    (phy == BLE_PHY_MODE_CODED_500KBPS)) {
        phy = NRF_RADIO->PDUSTAT & RADIO_PDUSTAT_CISTAT_Msk ?
                                   BLE_PHY_MODE_CODED_500KBPS :
                                   BLE_PHY_MODE_CODED_125KBPS;
    }
#endif

